In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

# Handling mussing data

In [3]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [10]:
print(string_data)
string_data[string_data.isnull()]

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

2    NaN
dtype: object

In [11]:
string_data[0]=None

In [12]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [13]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

# filtering data

In [14]:
from numpy import nan as NA

In [16]:
data = pd.Series([1, NA, 3.5, NA, 7])
data
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
....: [NA, NA, NA], [NA, 6.5, 3.]])

In [21]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
cleaned=data.dropna()

In [23]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [24]:
print(data)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [26]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [29]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [32]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0 -0.773290       NaN       NaN
1 -0.438574       NaN       NaN
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [33]:
print(df)
df.dropna()

          0         1         2
0 -0.773290       NaN       NaN
1 -0.438574       NaN       NaN
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

          0         1         2
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [35]:
print(df)
df.dropna(thresh=2)

          0         1         2
0 -0.773290       NaN       NaN
1 -0.438574       NaN       NaN
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

          0         1         2
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [38]:
# if null in ssspecific col
df[(df[1].notnull())]

          0         1         2
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

# Filling missing Data

In [39]:
df

          0         1         2
0 -0.773290       NaN       NaN
1 -0.438574       NaN       NaN
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [44]:
df.fillna(0)

          0         1         2
0 -0.773290  0.000000  0.000000
1 -0.438574  0.000000  0.000000
2 -0.647219  0.000000  0.501568
3 -1.346608  0.000000 -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [49]:
import random
df.fillna({1:5,2:7})

          0         1         2
0 -0.773290  5.000000  7.000000
1 -0.438574  5.000000  7.000000
2 -0.647219  5.000000  0.501568
3 -1.346608  5.000000 -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [51]:
df

          0         1         2
0 -0.773290       NaN       NaN
1 -0.438574       NaN       NaN
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [52]:
df.mean()

0   -0.880668
1   -1.395022
2    0.359729
dtype: float64

In [53]:
df.fillna(df.mean())

          0         1         2
0 -0.773290 -1.395022  0.359729
1 -0.438574 -1.395022  0.359729
2 -0.647219 -1.395022  0.501568
3 -1.346608 -1.395022 -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [57]:
df.fillna(df.mean(),inplace=True)

In [59]:
df.to_csv('data.csv')

In [61]:
df

          0         1         2
0 -0.773290 -1.395022  0.359729
1 -0.438574 -1.395022  0.359729
2 -0.647219 -1.395022  0.501568
3 -1.346608 -1.395022 -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [65]:
df=pd.DataFrame(np.random.randn(6,3))
df.iloc[2:-1,1]=NA
df.iloc[3:-1,2]=NA

df

          0         1         2
0 -0.246594  1.176619 -1.094767
1 -1.418060 -0.392877  0.346476
2  1.267099       NaN -0.183771
3 -1.444545       NaN       NaN
4  1.579977       NaN       NaN
5 -0.469086  0.085301 -0.707646

In [66]:
df

          0         1         2
0 -0.246594  1.176619 -1.094767
1 -1.418060 -0.392877  0.346476
2  1.267099       NaN -0.183771
3 -1.444545       NaN       NaN
4  1.579977       NaN       NaN
5 -0.469086  0.085301 -0.707646

In [68]:
df.fillna(method='ffill')

          0         1         2
0 -0.246594  1.176619 -1.094767
1 -1.418060 -0.392877  0.346476
2  1.267099 -0.392877 -0.183771
3 -1.444545 -0.392877 -0.183771
4  1.579977 -0.392877 -0.183771
5 -0.469086  0.085301 -0.707646

In [69]:
df.fillna(method='bfill')

          0         1         2
0 -0.246594  1.176619 -1.094767
1 -1.418060 -0.392877  0.346476
2  1.267099  0.085301 -0.183771
3 -1.444545  0.085301 -0.707646
4  1.579977  0.085301 -0.707646
5 -0.469086  0.085301 -0.707646

In [70]:
df.fillna(method='bfill',axis=1)

          0         1         2
0 -0.246594  1.176619 -1.094767
1 -1.418060 -0.392877  0.346476
2  1.267099 -0.183771 -0.183771
3 -1.444545       NaN       NaN
4  1.579977       NaN       NaN
5 -0.469086  0.085301 -0.707646

# data transformationm

## removing duplicates

In [71]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [72]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [74]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [75]:
data[data.duplicated()]

    k1  k2
6  two   4

In [76]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [77]:
data['v1'] = range(7)

In [80]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [81]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [82]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [83]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [87]:
lowercased = data['food'].str.lower()

In [88]:
data['animal'] = lowercased.map(meat_to_animal)

In [89]:
 data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [90]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [91]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [98]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [100]:
data.index=data.index.map(transform)

In [101]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [102]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [103]:
 data.rename(index={'OHIO': 'INDIANA'},
....: columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

# Discretization and Binning

In [105]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
slab=[18,25,40,60,120]
cat=pd.cut(ages,slab)
cat

[(18, 25], (18, 25], (18, 25], (25, 40], (18, 25], ..., (25, 40], (60, 120], (40, 60], (40, 60], (25, 40]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 40] < (40, 60] < (60, 120]]

In [106]:
cat.codes

array([0, 0, 0, 1, 0, 0, 1, 1, 3, 2, 2, 1], dtype=int8)

In [107]:
cat.categories

IntervalIndex([(18, 25], (25, 40], (40, 60], (60, 120]],
              closed='right',
              dtype='interval[int64]')

In [109]:
cat.value_counts()

(18, 25]     5
(25, 40]     4
(40, 60]     2
(60, 120]    1
dtype: int64

In [111]:
pd.cut(ages, slab,right=False)

[[18, 25), [18, 25), [25, 40), [25, 40), [18, 25), ..., [25, 40), [60, 120), [40, 60), [40, 60), [25, 40)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 40) < [40, 60) < [60, 120)]

In [113]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,slab,right=False,labels=group_names)

[Youth, Youth, YoungAdult, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

# Detecting and Filtering Outliers

In [115]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [116]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024061    -0.034070    -0.012509     0.035772
std       1.031424     0.980991     0.984060     0.977468
min      -3.652967    -3.503711    -3.125392    -3.046267
25%      -0.688197    -0.669534    -0.691179    -0.624316
50%       0.051097    -0.022321     0.015416     0.049516
75%       0.731103     0.645061     0.652976     0.669275
max       2.998309     2.805929     4.563756     3.252665

In [117]:
col=data[2]
col

0     -0.502816
1     -1.585753
2     -0.814447
3      0.071117
4      0.140273
         ...
995    0.171683
996    1.386559
997   -0.114539
998   -0.358925
999   -0.054763
Name: 2, Length: 1000, dtype: float64

In [118]:
col[np.abs(col) > 3]

189    4.563756
290   -3.125392
Name: 2, dtype: float64

In [119]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
34  -0.350607 -3.451365 -0.833041 -0.311662
122 -3.652967  0.006440  0.147540 -1.073304
182 -3.538168  0.444044 -1.233015 -0.752228
189 -0.858719  1.178803  4.563756 -0.194934
220 -1.364615 -0.477407  0.859271 -3.046267
290  0.608137  0.791571 -3.125392 -0.067697
326 -3.027608 -1.196477  0.491625  0.006477
336 -1.244854 -2.422990 -1.271516  3.252665
547 -3.100165 -0.041452  0.944623  0.049950
560 -3.091635  1.629750  0.004569  0.070082
645 -0.960140 -0.221568  0.075368  3.113039
663 -3.041457  1.163452  1.142533 -0.494252
709 -3.252585  2.646449 -0.359635 -1.336856
916 -3.025587  1.309730 -0.675509  1.361606
950  0.511142 -3.503711  0.985731 -0.734181

In [121]:
data[np.abs(data) > 3] = np.sign(data) * 3
data

            0         1         2         3
0    2.157661  0.428651 -0.502816 -0.827876
1   -1.293193  0.367098 -1.585753  0.334575
2    0.140267  0.984208 -0.814447 -1.978667
3    0.283087 -0.065539  0.071117  1.314900
4   -0.709218 -1.102991  0.140273  0.221438
..        ...       ...       ...       ...
995  1.093767 -0.911137  0.171683 -1.185575
996  1.838036 -0.675034  1.386559 -0.507311
997 -0.056344  0.202308 -0.114539 -0.886832
998 -1.325087 -1.384197 -0.358925 -0.592931
999 -0.458934  0.397666 -0.054763  1.460619

[1000 rows x 4 columns]

In [122]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025792    -0.033115    -0.013948     0.035453
std       1.025941     0.977861     0.977614     0.976173
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.688197    -0.669534    -0.691179    -0.624316
50%       0.051097    -0.022321     0.015416     0.049516
75%       0.731103     0.645061     0.652976     0.669275
max       2.998309     2.805929     3.000000     3.000000

In [123]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2  1.0  1.0 -1.0 -1.0
3  1.0 -1.0  1.0  1.0
4 -1.0 -1.0  1.0  1.0

## Computing Indicator/Dummy Variables

In [136]:
df=pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b','d','e','d'],
.....: 'data1': range(9)})

In [137]:
pd.get_dummies(df['key'])

   a  b  c  d  e
0  0  1  0  0  0
1  0  1  0  0  0
2  1  0  0  0  0
3  0  0  1  0  0
4  1  0  0  0  0
5  0  1  0  0  0
6  0  0  0  1  0
7  0  0  0  0  1
8  0  0  0  1  0